# Day 35 Pandas Filtering, Sorting & Indexing Example

In [1]:

import pandas as pd

# Sample DataFrame
data = {
    "Name": ["Amit", "Riya", "Suresh", "Neha", "Karan", "Priya"],
    "Age": [22, 25, 24, 23, 26, 22],
    "Department": ["AI", "DS", "AI", "ML", "DS", "ML"],
    "Salary": [50000, 60000, 55000, 58000, 62000, 54000]
}

df = pd.DataFrame(data)
df

     Name  Age Department  Salary
0    Amit   22         AI   50000
1    Riya   25         DS   60000
2  Suresh   24         AI   55000
3    Neha   23         ML   58000
4   Karan   26         DS   62000
5   Priya   22         ML   54000

## 1️⃣ Filtering Operations

In [2]:

# Filter employees with Age > 23
df[df["Age"] > 23]

     Name  Age Department  Salary
1    Riya   25         DS   60000
2  Suresh   24         AI   55000
4   Karan   26         DS   62000

In [3]:

# Filter using loc
df.loc[df["Department"] == "AI"]

     Name  Age Department  Salary
0    Amit   22         AI   50000
2  Suresh   24         AI   55000

In [4]:

# Filter using query
df.query("Salary >= 55000")

     Name  Age Department  Salary
1    Riya   25         DS   60000
2  Suresh   24         AI   55000
3    Neha   23         ML   58000
4   Karan   26         DS   62000

## 2️⃣ Sorting Operations

In [5]:

# Sort by Salary (ascending)
df.sort_values(by="Salary")

     Name  Age Department  Salary
0    Amit   22         AI   50000
5   Priya   22         ML   54000
2  Suresh   24         AI   55000
3    Neha   23         ML   58000
1    Riya   25         DS   60000
4   Karan   26         DS   62000

In [6]:

# Sort by Age (descending)
df.sort_values(by="Age", ascending=False)

     Name  Age Department  Salary
4   Karan   26         DS   62000
1    Riya   25         DS   60000
2  Suresh   24         AI   55000
3    Neha   23         ML   58000
0    Amit   22         AI   50000
5   Priya   22         ML   54000

In [7]:

# Sort by index
df.sort_index()

     Name  Age Department  Salary
0    Amit   22         AI   50000
1    Riya   25         DS   60000
2  Suresh   24         AI   55000
3    Neha   23         ML   58000
4   Karan   26         DS   62000
5   Priya   22         ML   54000

## 3️⃣ Indexing & Selection Operations

In [8]:

# Select specific rows using iloc
df.iloc[0:3]

     Name  Age Department  Salary
0    Amit   22         AI   50000
1    Riya   25         DS   60000
2  Suresh   24         AI   55000

In [9]:

# Select specific columns
df[["Name", "Salary"]]

     Name  Salary
0    Amit   50000
1    Riya   60000
2  Suresh   55000
3    Neha   58000
4   Karan   62000
5   Priya   54000

In [10]:

# Set Name as index
df_indexed = df.set_index("Name")
df_indexed

        Age Department  Salary
Name
Amit     22         AI   50000
Riya     25         DS   60000
Suresh   24         AI   55000
Neha     23         ML   58000
Karan    26         DS   62000
Priya    22         ML   54000

In [11]:

# Access data using index
df_indexed.loc["Riya"]

Age              25
Department       DS
Salary        60000
Name: Riya, dtype: object

In [12]:

# Reset index
df_indexed.reset_index()

     Name  Age Department  Salary
0    Amit   22         AI   50000
1    Riya   25         DS   60000
2  Suresh   24         AI   55000
3    Neha   23         ML   58000
4   Karan   26         DS   62000
5   Priya   22         ML   54000